insert into currency (code, name) values
    ('BYN', 'Белорусский рубль'),
    ('USD', 'Доллар США'),
    ('EUR', 'Евро');

-- Балансовые счета, необходимые для депозитных и кредитных программ физических лиц
insert into chart_of_accounts (code, name, activity) values
    ('1010', 'Денежные средства в кассе', 'ACTIVE'),
    ('1201', 'Корреспондентский счёт в Национальном банке', 'ACTIVE'),
    ('2400', 'Кредиты физическим лицам', 'ACTIVE'),
    ('2470', 'Начисленные процентные доходы по кредитам физическим лицам', 'ACTIVE'),
    ('3012', 'Текущие (расчётные) счета коммерческих организаций', 'PASSIVE'),
    ('3014', 'Текущие (расчётные) счета физических лиц', 'PASSIVE'),
    ('3404', 'Вклады (депозиты) до востребования физических лиц', 'PASSIVE'),
    ('3414', 'Срочные вклады (депозиты) физических лиц', 'PASSIVE'),
    ('3470', 'Начисленные процентные расходы по вкладам (депозитам) до востребования', 'PASSIVE'),
    ('3471', 'Начисленные процентные расходы по срочным вкладам (депозитам)', 'PASSIVE'),
    ('7327', 'Фонд развития банка', 'PASSIVE');

insert into bank_day (id, bank_date) values (1, current_date);
